UnRegularized 512 GRU
2018-05-07 15:32:09

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (apply_unit_distance_normalization):
	Unit Distance Normalization

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

* [expand:train/valid|test] (rotate_digit):
	Rotate Digits
	>> args: ()
	>> keywords: {'degrees': [5, 10, 15, 45, -5, -10, -15, -45]}

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 200
Number of Epochs: 30

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_27 (GRU)                 (None, 50, 512)           791040    
_________________________________________________________________
dropout_26 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_28 (GRU)                 (None, 50, 512)           1575936   
_________________________________________________________________
dropout_27 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_29 (GRU)                 (None, 512)               1575936   
_________________________________________________________________
dropout_28 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_23 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_24 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_24 (Activation)   (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

