Regularized 3x512 GRU
2018-05-14 22:51:29

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (apply_unit_distance_normalization):
	Unit Distance Normalization

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 500
Number of Epochs: 70

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_25 (GRU)                 (None, 50, 512)           791040    
_________________________________________________________________
dropout_33 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_26 (GRU)                 (None, 50, 512)           1575936   
_________________________________________________________________
dropout_34 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_27 (GRU)                 (None, 512)               1575936   
_________________________________________________________________
dropout_35 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_17 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_36 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_18 (Activation)   (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

