Regularized 3x512 GRU
2018-05-15 00:03:16

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (apply_unit_distance_normalization):
	Unit Distance Normalization

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

* [expand:train/valid|test] (rotate_digit):
	Rotate Digits
	>> args: ()
	>> keywords: {'degrees': [5, 10, 15, 45, -5, -10, -15, -45]}

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 500
Number of Epochs: 70

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_16 (GRU)                 (None, 50, 512)           791040    
_________________________________________________________________
dropout_21 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_17 (GRU)                 (None, 50, 512)           1575936   
_________________________________________________________________
dropout_22 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_18 (GRU)                 (None, 512)               1575936   
_________________________________________________________________
dropout_23 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_11 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_12 (Activation)   (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

