Regularized 3x512 GRU
2018-05-14 23:00:00

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (apply_unit_distance_normalization):
	Unit Distance Normalization

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

* [expand:train/valid|test] (reverse_digit_sequence):
	Reverse Order of Digit Sequences

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 500
Number of Epochs: 70

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_7 (GRU)                  (None, 50, 512)           791040    
_________________________________________________________________
dropout_9 (Dropout)          (None, 50, 512)           0         
_________________________________________________________________
gru_8 (GRU)                  (None, 50, 512)           1575936   
_________________________________________________________________
dropout_10 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_9 (GRU)                  (None, 512)               1575936   
_________________________________________________________________
dropout_11 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_5 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                2570      
_________________________________________________________________
activation_6 (Activation)    (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

