Regularized 3x512 GRU
2018-05-14 22:39:10

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 500
Number of Epochs: 60

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_19 (GRU)                 (None, 50, 512)           791040    
_________________________________________________________________
dropout_25 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_20 (GRU)                 (None, 50, 512)           1575936   
_________________________________________________________________
dropout_26 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_21 (GRU)                 (None, 512)               1575936   
_________________________________________________________________
dropout_27 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_13 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_14 (Activation)   (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

