Regularized 3x512 GRU
2018-05-15 01:15:47

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

* [expand:train/valid|test] (rotate_digit):
	Rotate Digits
	>> args: ()
	>> keywords: {'degrees': [5, 10, 15, 45, -5, -10, -15, -45]}

* [expand:train/valid|test] (reverse_digit_sequence):
	Reverse Order of Digit Sequences

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 500
Number of Epochs: 70

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_22 (GRU)                 (None, 50, 512)           791040    
_________________________________________________________________
dropout_29 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_23 (GRU)                 (None, 50, 512)           1575936   
_________________________________________________________________
dropout_30 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_24 (GRU)                 (None, 512)               1575936   
_________________________________________________________________
dropout_31 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_15 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_16 (Activation)   (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

