UnRegularized 512 GRU
2018-05-07 15:36:40

----------

* [modify:train/valid|test] (apply_mean_centering):
	Mean Centering

* [modify:train/valid|test] (apply_unit_distance_normalization):
	Unit Distance Normalization

* [modify:train/valid|test] (spline_interpolate_and_resample):
	B-Spine Interpolation and Resampling (Warning: Deletes time and pressure features!)
	>> args: ()
	>> keywords: {'num_samples': 50}

* [expand:train/valid|test] (rotate_digit):
	Rotate Digits
	>> args: ()
	>> keywords: {'degrees': [5, 10, 15, 45, -5, -10, -15, -45]}

----------

Optimizer: <class 'keras.optimizers.Nadam'>
Batch Size: 500
Number of Epochs: 30

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_30 (GRU)                 (None, 50, 512)           791040    
_________________________________________________________________
dropout_30 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_31 (GRU)                 (None, 50, 512)           1575936   
_________________________________________________________________
dropout_31 (Dropout)         (None, 50, 512)           0         
_________________________________________________________________
gru_32 (GRU)                 (None, 512)               1575936   
_________________________________________________________________
dropout_32 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 256)               131328    
_________________________________________________________________
activation_25 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_26 (Activation)   (None, 10)                0         
=================================================================
Total params: 4,076,810
Trainable params: 4,076,810
Non-trainable params: 0
_________________________________________________________________


----------

